cf/Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УровниСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодParsec</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты_ст</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыдачиКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипШтрихКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШтрихКодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнформационнаяКарта_УДАЛИТЬ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ПродажиПоДисконтнымКартам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПоДисконтнымКартам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Parsec</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ТипыШтрихКодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыШтрихКодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Code128</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Code39</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EAN128</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EAN13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EAN8</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ИнформационныеКарты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьШтрихКод(Команда)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ОткрытьФорму("РегистрСведений.ШтрихКоды.Форма.ФормаЗаписи", Новый Структура("ИнформационнаяКарта", Объект.Ссылка), ЭтаФорма);
	КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ЗапросБаланса()
	                                                   
	Запрос = Новый Запрос("ВЫБРАТЬ СуммаОборот ИЗ РегистрНакопления.ПродажиПоДисконтнымКартам.Обороты(,,, ИнформационнаяКарта = &Ссылка)");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		БалансКарты = Выборка.СуммаОборот;
	КонецЕсли;
	
	БалансКарты = БалансКарты + Объект.Сумма;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	ЭтоПарсек = Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Parsec;
	
	//Элементы.Сумма.Видимость = НЕ (Объект.ТипКарты.Пустая() ИЛИ Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.ДисконтнаяКарта);	
	Элементы.Процент.Видимость = НЕ (Объект.ТипКарты.Пустая() ИЛИ Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.ПодарочныйСертификат);
	
	Элементы.ГруппаСкидки.Видимость 	= Не ЭтоПарсек;
	Элементы.Владелец.Видимость 		= Не ЭтоПарсек;
	Элементы.ГруппаШтрихКод.Видимость 	= Не ЭтоПарсек;
	Элементы.БалансКарты.Видимость 		= Не ЭтоПарсек;
	Элементы.ДатаСоздания.Видимость     = Не ЭтоПарсек;
	Элементы.ГруппаParsec.Видимость 	= ЭтоПарсек;
	
КонецПроцедуры  	

&НаСервере
Функция ПолучитьШтрихКод()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ШтрихКод,
	|	ТипШтрихКода
	|ИЗ
	|	РегистрСведений.Штрихкоды
	|ГДЕ
	|	Объект = &Ссылка
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ШтрихКод, ТипШтрихКода", Выборка.ШтрихКод, Выборка.ТипШтрихКода);			
	КонецЕсли;
	
	Возврат Новый Структура("ШтрихКод, ТипШтрихКода", "", Перечисления.ТипыШтрихКодов.EAN13);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.ДисконтнаяКарта;
		ТипШтрихКода = Перечисления.ТипыШтрихКодов.EAN13;
		Объект.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПолучитьШтрихКод());
	
	УправлениеВидимостью();
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ШтрихКоды, "ИнформационнаяКарта", Объект.Ссылка, Истина);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ШтрихКоды, "Номенклатура", Справочники.Номенклатура.ПустаяСсылка(), Истина);
	
	врШтрихКод = ШтрихКод;
	
	ЗапросБаланса();
	
КонецПроцедуры   

&НаКлиенте
Процедура БалансКартыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", Новый Структура("ИнформационнаяКарта", Объект.Ссылка), , Истина);
	ОткрытьФорму("Отчет.ПродажиПоДисконтнымКартам.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТипКартыПриИзменении(Элемент)
	
	УправлениеВидимостью();	

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если врШтрихКод <> "" И врШтрихКод <> ШтрихКод Тогда
		
		ЗаписьШтрихкода = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
		
		ЗаписьШтрихкода.Объект				= Объект.Ссылка;
		ЗаписьШтрихкода.ТипШтрихКода 		= ТипШтрихКода;
		ЗаписьШтрихкода.ШтрихКод     		= ШтрихКод;
		
		Попытка
			ЗаписьШтрихкода.Записать();
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	Если ШтрихКод <> "" И врШтрихКод <> ШтрихКод Тогда
		ЗаписьШтрихкода = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
		
		ЗаписьШтрихкода.Объект				= Объект.Ссылка;
		ЗаписьШтрихкода.ТипШтрихКода 		= ТипШтрихКода;
		ЗаписьШтрихкода.ШтрихКод     		= ШтрихКод;
		
		Попытка
			ЗаписьШтрихкода.Записать();
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
